package Noro;

public class calculations
{
    /*------------------------------------------------------------------------*/
    /** Вычисляет катет прямоугольного треугольника по гипотенузе и другому катету
     * @param c гипотенуза прямоугольного треугольника
     * @param a катет прямоугольного треугольника
     * @return значение второго катета
    **/
    public static double cath(double c, double a)
    {
        double res = 0.0;
        res = (double) Math.sqrt(Math.pow(c, 2.0) - Math.pow(a, 2.0));
        return res;
    }
    /*------------------------------------------------------------------------*/
    /** Вычисляет радиус вписанной в прямоугольный треугольник окружности по его катетам и гипотенузе
     * @param a первый катет прямоугольного треугольника
     * @param b второй катет прямоугольного треугольника
     * @param c гипотенуза прямоугольного треугольника
     * @return радиус вписанной окружности
     **/
    public static double roic(double a, double b, double c)
    {
        double res = 0.0;
        res = (double) ((a + b - c) / 2.0);
        return res;
    }
    /*------------------------------------------------------------------------*/
}
